In [2]:
import pandas as pd

In [3]:
df=pd.ExcelFile('Dynamic Industrial Data.xlsx')
df_payable=pd.read_excel(df,'Accounts Payable Summary')
df_purchase=pd.read_excel(df,'Purchasing Information')

In [4]:
df_payable.head()

,Invoice,Received,Vendor,SKU,Purchase order,Total Price,Paid
0,1000587,2017-12-08,Technical Innovations,825608,5399,3132.5,Yes
1,10056,2017-12-09,Alpha,100525,5400,645.0,Yes
2,10056,2017-12-09,Alpha,101652,5400,1500.0,Yes
3,10056,2017-12-09,Alpha,108900,5400,8350.0,Yes
4,10056,2017-12-09,Alpha,110852,5400,1725.0,Yes

In [5]:
df_purchase.head()

,Purchase order,PO Date,Purchasing Agent,Vendor,SKU,Quantity
0,5399,2017-12-04,Alex,Technical Innovations,825608,1750
1,5400,2017-12-05,Chris,Alpha,100525,500
2,5400,2017-12-05,Chris,Alpha,101652,1000
3,5400,2017-12-05,Chris,Alpha,108900,5000
4,5400,2017-12-05,Chris,Alpha,110852,1500

In [6]:
df_payable18=df_payable[df_payable['Received']>'2018-01-01']

In [7]:
new_df=pd.merge(df_payable18,df_purchase,how='inner',left_on=['SKU','Purchase order'],right_on=['SKU','Purchase order'])

In [8]:
new_df.head()

,Invoice,Received,Vendor_x,SKU,Purchase order,Total Price,Paid,PO Date,Purchasing Agent,Vendor_y,Quantity
0,10078,2018-01-03,Alpha,100525,5405,645.0,Yes,2017-12-28,Chris,Alpha,500
1,10078,2018-01-03,Alpha,101652,5405,300.0,Yes,2017-12-28,Chris,Alpha,200
2,10078,2018-01-03,Alpha,108900,5405,175.0,Yes,2017-12-28,Chris,Alpha,100
3,10078,2018-01-03,Alpha,119561,5405,180.0,Yes,2017-12-28,Chris,Alpha,100
4,1000613,2018-01-07,Technical Innovations,825608,5406,8950.0,Yes,2018-01-03,Alex,Technical Innovations,5000

In [9]:
new_df.groupby('SKU')['Total Price'].sum()

SKU
100525       5225.0
101652       5550.0
108900      12625.0
110852       4575.0
111568       2145.0
118741      11160.0
119561       4140.0
202456    1128750.0
300080       1197.6
300082       8250.0
300091       1558.0
300095      10000.0
555874       1800.0
555902       3120.0
555916       5992.5
825600      46300.0
825605      46300.0
825608      34390.0
Name: Total Price, dtype: float64

In [10]:
df_payable18.groupby('SKU')['Total Price'].sum()

SKU
100525       5225.0
101652       5550.0
108900      12625.0
110852       4575.0
111568       2145.0
118741      11160.0
119561       4140.0
202456    1128750.0
300080       1197.6
300082       8250.0
300091       1558.0
300095      10000.0
555874       1800.0
555902       3120.0
555916       5992.5
825600      46300.0
825605      46300.0
825608      34390.0
Name: Total Price, dtype: float64

In [25]:
new_df.groupby(['SKU','Purchase order'])['Quantity'].sum()

SKU     Purchase order
100525  5405                 500
        5414                 500
        5415                2000
        5416                 500
        5420                 500
        5423                 500
101652  5405                 200
        5410                 200
        5414                1000
        5416                 500
        5420                 500
        5423                1000
108900  5405                 100
        5410                1000
        5414                1000
        5416                 200
        5420                2500
        5423                2500
110852  5410                 200
        5415                4000
        5420                 300
111568  5410                 500
        5414                 500
        5420                 500
118741  5410                2000
        5416                2000
        5420                2000
119561  5405                 100
        5414                1000
        5416                 200
        5420                1000
202456  5411               35000
        5417               35000
        5424               35000
300080  5407               12000
        5412               12000
300082  5407               55000
        5419               55000
300091  5407               10000
        5419               10000
300095  5412              100000
555874  5408               20000
        5418               20000
555902  5408               20000
        5418               20000
555916  5408               37500
        5418               37500
825600  5409                5000
        5413                5000
        5421                5000
825605  5409                5000
        5413                5000
        5421                5000
825608  5406                5000
        5413               16000
Name: Quantity, dtype: int64

In [26]:
new_df.groupby('SKU')['Quantity'].sum()

SKU
100525      4500
101652      3400
108900      7300
110852      4500
111568      1500
118741      6000
119561      2300
202456    105000
300080     24000
300082    110000
300091     20000
300095    100000
555874     40000
555902     40000
555916     75000
825600     15000
825605     15000
825608     21000
Name: Quantity, dtype: int64

In [29]:
dfex=new_df.groupby('SKU')['Quantity'].sum()

In [32]:
dfex.to_excel('output1.xlsx', engine='xlsxwriter')